[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:31:51
     "JobsSearch.SortDirection",
     "ASC",
   );
-  const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "5");
+  const [pageSize, setPageSize] = useLocalStorage("", "5");
 
   useEffect(() => {
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
-   "JobsSearch.PageSize,5": 6,
+   ",5": 2,

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:33:19
   );
   const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "5");
 
-  useEffect(() => {
-    setSelectedPage(1);
-  }, [pageSize]);
+  useEffect(() => {}, [pageSize]);
 
   const refreshJobsIntervalMilliseconds = 5000;
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] OptionalChaining
main/pages/Admin/AdminJobsPage.js:219:21
       <div style={{ marginBottom: "1rem" }} />
       <OurPagination
         updateActivePage={setSelectedPage}
-        totalPages={page?.totalPages || 0}
+        totalPages={page.totalPages || 0}
         currentPage={selectedPage}
       />
killedBy: AdminJobsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'totalPages')

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:219:21
       <div style={{ marginBottom: "1rem" }} />
       <OurPagination
         updateActivePage={setSelectedPage}
-        totalPages={page?.totalPages || 0}
+        totalPages={false}
         currentPage={selectedPage}
       />
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OurPagination-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:225:24
 
       <h2 className="p-3">Job Status</h2>
 
-      <JobsTable jobs={page?.content || []} />
+      <JobsTable jobs={false} />
       <Button variant="danger" onClick={purgeJobLog} data-testid="purgeJobLog">
         Purge Job Log
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Invalid data value

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:225:24
 
       <h2 className="p-3">Job Status</h2>
 
-      <JobsTable jobs={page?.content || []} />
+      <JobsTable jobs={true} />
       <Button variant="danger" onClick={purgeJobLog} data-testid="purgeJobLog">
         Purge Job Log
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Invalid data value
