[Survived] StringLiteral
main/components/Area/SingleAreaDropdown.js:9:11
   setArea,
   controlId,
   onChange = null,
-  label = "General Education Area",
+  label = "",
 }) => {
   const localSearchArea = localStorage.getItem(controlId);

[Survived] BlockStatement
main/components/Area/SingleAreaDropdown.js:17:41
     localSearchArea || "A",
   );
 
-  const handleAreatoChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setAreaState(event.target.value);
-    setArea(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleAreatoChange = (event) => {};
 
   return (

[Survived] ConditionalExpression
main/components/Area/SingleAreaDropdown.js:21:9
     localStorage.setItem(controlId, event.target.value);
     setAreaState(event.target.value);
     setArea(event.target.value);
-    if (onChange != null) {
+    if (true) {
       onChange(event);
     }

[Survived] BlockStatement
main/components/Area/SingleAreaDropdown.js:21:27
     localStorage.setItem(controlId, event.target.value);
     setAreaState(event.target.value);
     setArea(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 

[Survived] BlockStatement
main/components/Area/SingleAreaDropdown.js:30:41
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={areaState} onChange={handleAreatoChange}>
-        {areas.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object[0]}>
-              {object[0]} - {object[1]}
-            </option>
-          );
-        })}
+        {areas.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>

[Survived] StringLiteral
main/components/Area/SingleAreaDropdown.js:31:23
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={areaState} onChange={handleAreatoChange}>
         {areas.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object[0]}>
