[Killed] BooleanLiteral
main/components/Areas/SingleAreaDropdown.js:13:13
   controlId,
   onChange = null,
   label = "General Education Area",
-  showAll = false,
+  showAll = true,
 }) => {
   const localSearchArea = localStorage.getItem(controlId);
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Areas/SingleAreaDropdown.js:26:9
     localStorage.setItem(controlId, event.target.value);
     setAreaState(event.target.value);
     setArea(event.target.value);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: SingleAreaDropdown tests when I select an object, the value changes
statusReason: TypeError: onChange is not a function

[Killed] ConditionalExpression
main/components/Areas/SingleAreaDropdown.js:26:9
     localStorage.setItem(controlId, event.target.value);
     setAreaState(event.target.value);
     setArea(event.target.value);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleAreaDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/Areas/SingleAreaDropdown.js:34:17
   // Remove duplicates from the areas array
   const uniqueAreas = Array.from(
     new Map(
-      areas.map((item) => [
-        `${item.requirementCode}-${item.collegeCode}`,
-        item,
-      ]),
+      areas.map(() => undefined),
     ).values(),
   );
killedBy: SingleAreaDropdown tests renders without crashing on one area
statusReason: TypeError: Iterator value undefined is not an entry object

[Killed] StringLiteral
main/components/Areas/SingleAreaDropdown.js:35:9
   const uniqueAreas = Array.from(
     new Map(
       areas.map((item) => [
-        `${item.requirementCode}-${item.collegeCode}`,
+        ``,
         item,
       ]),
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: Unable to find an element by: [data-testid="sad1-option-A1-ENGR"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] MethodExpression
main/components/Areas/SingleAreaDropdown.js:41:3
     ).values(),
   );
 
-  uniqueAreas.sort((a, b) =>
-    a.requirementCode.localeCompare(b.requirementCode),
-  );
+  uniqueAreas;
 
   return (
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
main/components/Areas/SingleAreaDropdown.js:41:20
     ).values(),
   );
 
-  uniqueAreas.sort((a, b) =>
-    a.requirementCode.localeCompare(b.requirementCode),
+  uniqueAreas.sort(() => undefined,
   );
 
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
main/components/Areas/SingleAreaDropdown.js:49:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={areaState} onChange={handleAreatoChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {showAll || <option data-testid={`${controlId}-option-all`} value="ALL">
+            ALL
+          </option>}
         {uniqueAreas.map((object) => {
           const key = `${controlId}-option-${object.requirementCode}-${object.collegeCode}`;
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Areas/SingleAreaDropdown.js:49:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={areaState} onChange={handleAreatoChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {true}
         {uniqueAreas.map((object) => {
           const key = `${controlId}-option-${object.requirementCode}-${object.collegeCode}`;
killedBy: SingleAreaDropdown tests renders "ALL" option when showAll is true
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/Areas/SingleAreaDropdown.js:50:32
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={areaState} onChange={handleAreatoChange}>
         {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
+          <option data-testid={``} value="ALL">
             ALL
           </option>
killedBy: SingleAreaDropdown tests renders "ALL" option when showAll is true
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Areas/SingleAreaDropdown.js:54:38
             ALL
           </option>
         )}
-        {uniqueAreas.map((object) => {
-          const key = `${controlId}-option-${object.requirementCode}-${object.collegeCode}`;
-
-          // Remove "-L&S" or "-Engr" from requirementTranslation if they exist
-          const cleanedTranslation = object.requirementTranslation.replace(
-            / - L&S| - Engr/gi,
-            "",
-          );
-
-          return (
-            <option
-              key={key}
-              data-testid={key}
-              value={`${object.requirementCode}-${object.collegeCode}`}
-            >
-              {object.requirementCode} - {cleanedTranslation} (
-              {object.collegeCode})
-            </option>
-          );
-        })}
+        {uniqueAreas.map((object) => {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: Unable to find an element by: [data-testid="sad1-option-A1-ENGR"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Areas/SingleAreaDropdown.js:55:23
           </option>
         )}
         {uniqueAreas.map((object) => {
-          const key = `${controlId}-option-${object.requirementCode}-${object.collegeCode}`;
+          const key = ``;
 
           // Remove "-L&S" or "-Engr" from requirementTranslation if they exist
killedBy: SingleAreaDropdown tests renders without crashing on three areas
statusReason: Error: Unable to find an element by: [data-testid="sad1-option-A1-ENGR"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
