[Killed] BlockStatement
main/pages/GeneralEducation/GeneralEducationSearchPage.js:3:54
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function GeneralEducationSearchPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>GE Search coming soon!</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function GeneralEducationSearchPage() {}
 
killedBy: GeneralEducationSearchPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: GE Search coming soon!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
