[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:17:5
   // Stryker restore all
 
   const [sortField, setSortField] = useLocalStorage(
-    "JobsSearch.SortField",
+    "",
     sortFields[0],
   );
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
+   ",status": 2,
    "JobsSearch.PageSize,5": 6,

[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:25:5
     sortDirections[0],
   );
   const [pageSize, setPageSize] = useLocalStorage(
-    "JobsSearch.PageSize",
+    "",
     pageSizes[0],
   );
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
-   "JobsSearch.PageSize,5": 6,
+   ",5": 2,

[Killed] BlockStatement
main/components/Jobs/JobsSearchForm.js:29:40
     pageSizes[0],
   );
 
-  const doUpdateSortField = (value) => {
-    setSortField(value);
-    updateSortField(value);
-  };
+  const doUpdateSortField = (value) => {};
 
   const doUpdateSortDirection = (value) => {
killedBy: JobsSearchForm when I select a sortField, the state and localStorage update and callback is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "createdAt"

Number of calls: 0

[Killed] BlockStatement
main/components/Jobs/JobsSearchForm.js:34:44
     updateSortField(value);
   };
 
-  const doUpdateSortDirection = (value) => {
-    setSortDirection(value);
-    updateSortDirection(value);
-  };
+  const doUpdateSortDirection = (value) => {};
 
   const doUpdatePageSize = (value) => {
killedBy: JobsSearchForm when I select a sortDirection, the state and localStorage update and callback is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "DESC"

Number of calls: 0

[Killed] BlockStatement
main/components/Jobs/JobsSearchForm.js:39:39
     updateSortDirection(value);
   };
 
-  const doUpdatePageSize = (value) => {
-    setPageSize(value);
-    updatePageSize(value);
-  };
+  const doUpdatePageSize = (value) => {};
 
   return (
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

Ignored nodes: comments, script, style
<html>
  <head />
