[Killed] BlockStatement
main/components/Jobs/JobsTable.js:26:19
 
       Cell: ({ cell }) => {
         const log = cell.row.original.log;
-        if (!log) {
-          return (
-            <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-              No logs available
-            </div>
-          );
-        }
+        if (!log) {}
         const logLines = log.split("\n");
         const truncatedLog = logLines.slice(0, 10).join("\n");
killedBy: JobsTable tests displays 'No logs available' when log is empty or null
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:33:36
             </div>
           );
         }
-        const logLines = log.split("\n");
+        const logLines = log.split("");
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello Worl...See entire log

[Killed] MethodExpression
main/components/Jobs/JobsTable.js:34:30
           );
         }
         const logLines = log.split("\n");
-        const truncatedLog = logLines.slice(0, 10).join("\n");
+        const truncatedLog = logLines.join("\n");
         return (
           <div
killedBy: JobsTable tests renders long logs and handles truncation (snapshot)
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `JobsTable tests renders long logs and handles truncation (snapshot) 1`

- Snapshot  -  0
+ Received  + 22

@@ -42,10 +42,32 @@

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:45:14
             }}
             data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}
           >
-            {logLines.length > 10 ? (
+            {true ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello World! from test job!Goodbye from test job!...See entire log

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:45:14
             }}
             data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}
           >
-            {logLines.length > 10 ? (
+            {logLines.length >= 10 ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests does not show 'See entire log' for logs of exactly 10 lines
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a href="/admin/jobs/logs/2">See entire log</a> instead
