[Killed] BlockStatement
main/components/Utils/OurPagination.js:15:19
 }) => {
   const [activePage, setActivePage] = useState(currentPage);
 
-  useEffect(() => {
-    setActivePage(currentPage);
-  }, [currentPage]);
+  useEffect(() => {}, [currentPage]);
 
   const nextPage = () => {
killedBy: OurPagination tests updates active page when currentPage prop changes
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] BlockStatement
main/components/Utils/OurPagination.js:19:26
     setActivePage(currentPage);
   }, [currentPage]);
 
-  const nextPage = () => {
-    const newPage = Math.min(activePage + 1, totalPages);
-    setActivePage(newPage);
-    updateActivePage(newPage);
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     const newPage = Math.max(activePage - 1, 1);
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] BlockStatement
main/components/Utils/OurPagination.js:47:58
 
   const generateSimplePaginationItems = () => {
     const paginationItems = emptyArray();
-    for (let number = 1; number <= totalPages; number++) {
-      paginationItems.push(pageButton(number));
-    }
+    for (let number = 1; number <= totalPages; number++) {}
     return paginationItems;
   };
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OurPagination-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:56:26
   const generatePaginationItemsWithEllipsis = () => {
     const paginationItems = emptyArray();
 
-    const leftEllipsis = activePage > 3;
+    const leftEllipsis = activePage >= 3;
     const rightEllipsis = activePage < totalPages - 2;
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:56:26
   const generatePaginationItemsWithEllipsis = () => {
     const paginationItems = emptyArray();
 
-    const leftEllipsis = activePage > 3;
+    const leftEllipsis = true;
     const rightEllipsis = activePage < totalPages - 2;
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:57:40
     const paginationItems = emptyArray();
 
     const leftEllipsis = activePage > 3;
-    const rightEllipsis = activePage < totalPages - 2;
+    const rightEllipsis = activePage < totalPages + 2;
 
     paginationItems.push(pageButton(1));
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:57:27
     const paginationItems = emptyArray();
 
     const leftEllipsis = activePage > 3;
-    const rightEllipsis = activePage < totalPages - 2;
+    const rightEllipsis = activePage <= totalPages - 2;
 
     paginationItems.push(pageButton(1));
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 8

[Killed] BlockStatement
main/components/Utils/OurPagination.js:60:23
     const rightEllipsis = activePage < totalPages - 2;
 
     paginationItems.push(pageButton(1));
-    if (leftEllipsis) {
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
-        />,
-      );
-    }
+    if (leftEllipsis) {}
     // Show a range of pages around the active page
     let start = Math.max(activePage - 1, 2);
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 8

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:60:9
     const rightEllipsis = activePage < totalPages - 2;
 
     paginationItems.push(pageButton(1));
-    if (leftEllipsis) {
+    if (true) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:69:26
       );
     }
     // Show a range of pages around the active page
-    let start = Math.max(activePage - 1, 2);
+    let start = Math.max(activePage + 1, 2);
     let end = Math.min(activePage + 1, totalPages - 1);
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] MethodExpression
main/components/Utils/OurPagination.js:69:17
       );
     }
     // Show a range of pages around the active page
-    let start = Math.max(activePage - 1, 2);
+    let start = Math.min(activePage - 1, 2);
     let end = Math.min(activePage + 1, totalPages - 1);
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 8

[Killed] MethodExpression
main/components/Utils/OurPagination.js:70:15
     }
     // Show a range of pages around the active page
     let start = Math.max(activePage - 1, 2);
-    let end = Math.min(activePage + 1, totalPages - 1);
+    let end = Math.max(activePage + 1, totalPages - 1);
 
     for (let number = start; number <= end; number++) {
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 15

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:70:40
     }
     // Show a range of pages around the active page
     let start = Math.max(activePage - 1, 2);
-    let end = Math.min(activePage + 1, totalPages - 1);
+    let end = Math.min(activePage + 1, totalPages + 1);
 
     for (let number = start; number <= end; number++) {
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 8

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:72:30
     let start = Math.max(activePage - 1, 2);
     let end = Math.min(activePage + 1, totalPages - 1);
 
-    for (let number = start; number <= end; number++) {
+    for (let number = start; number < end; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:72:30
     let start = Math.max(activePage - 1, 2);
     let end = Math.min(activePage + 1, totalPages - 1);
 
-    for (let number = start; number <= end; number++) {
+    for (let number = start; false; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] BlockStatement
main/components/Utils/OurPagination.js:76:24
       paginationItems.push(pageButton(number));
     }
 
-    if (rightEllipsis) {
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      );
-    }
+    if (rightEllipsis) {}
     paginationItems.push(pageButton(totalPages));
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:76:9
       paginationItems.push(pageButton(number));
     }
 
-    if (rightEllipsis) {
+    if (true) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] ArrowFunction
main/components/Utils/OurPagination.js:89:35
     return paginationItems;
   };
 
-  const generatePaginationItems = () =>
-    totalPages <= maxPages
-      ? generateSimplePaginationItems()
-      : generatePaginationItemsWithEllipsis();
+  const generatePaginationItems = () => undefined;
 
   return (
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 2

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:90:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= maxPages
+    totalPages > maxPages
       ? generateSimplePaginationItems()
       : generatePaginationItemsWithEllipsis();
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:90:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= maxPages
+    totalPages < maxPages
       ? generateSimplePaginationItems()
       : generatePaginationItemsWithEllipsis();
killedBy: OurPagination tests renders the correct text for totalPages 10 maxPages 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 6
