[Timeout] BlockStatement
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:12:42
   const [style, setStyle] = useState({});
   const testId = "PersonalSectionsEvent";
 
-  const convertTimeToMinutes = (time) => {
-    const [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    return hours * 60 + minutes * 1;
-  };
+  const convertTimeToMinutes = (time) => {};
 
   const convert24Hourto12Hour = (time) => {

[Killed] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:13:31
   const testId = "PersonalSectionsEvent";
 
   const convertTimeToMinutes = (time) => {
-    const [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
+    const [hours, minutes] = [time, time.slice(-2)];
     return hours * 60 + minutes * 1;
   };
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Timeout] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:13:49
   const testId = "PersonalSectionsEvent";
 
   const convertTimeToMinutes = (time) => {
-    const [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
+    const [hours, minutes] = [time.slice(0, 2), time];
     return hours * 60 + minutes * 1;
   };

[Killed] ArithmeticOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:14:12
 
   const convertTimeToMinutes = (time) => {
     const [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    return hours * 60 + minutes * 1;
+    return hours * 60 - minutes * 1;
   };
 
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:10 with font size null
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 10px;
+ height: -10px;

[Killed] ArithmeticOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:14:12
 
   const convertTimeToMinutes = (time) => {
     const [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    return hours * 60 + minutes * 1;
+    return hours / 60 + minutes * 1;
   };
 
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] BlockStatement
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:17:43
     return hours * 60 + minutes * 1;
   };
 
-  const convert24Hourto12Hour = (time) => {
-    let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    if (hours * 1 > 12) {
-      let hTemp = hours * 1 - 12;
-      hours = hTemp.toString();
-    }
-    return hours + ":" + minutes;
-  };
+  const convert24Hourto12Hour = (time) => {};
 
   // Stryker disable all : hard to test for specfic styles
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:18:29
   };
 
   const convert24Hourto12Hour = (time) => {
-    let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
+    let [hours, minutes] = [time, time.slice(-2)];
     if (hours * 1 > 12) {
       let hTemp = hours * 1 - 12;
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:18:47
   };
 
   const convert24Hourto12Hour = (time) => {
-    let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
+    let [hours, minutes] = [time.slice(0, 2), time];
     if (hours * 1 > 12) {
       let hTemp = hours * 1 - 12;
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] EqualityOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:19:9
 
   const convert24Hourto12Hour = (time) => {
     let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    if (hours * 1 > 12) {
+    if (hours * 1 <= 12) {
       let hTemp = hours * 1 - 12;
       hours = hTemp.toString();
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] BlockStatement
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:19:25
 
   const convert24Hourto12Hour = (time) => {
     let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
-    if (hours * 1 > 12) {
-      let hTemp = hours * 1 - 12;
-      hours = hTemp.toString();
-    }
+    if (hours * 1 > 12) {}
     return hours + ":" + minutes;
   };
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] ArithmeticOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:20:19
   const convert24Hourto12Hour = (time) => {
     let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
     if (hours * 1 > 12) {
-      let hTemp = hours * 1 - 12;
+      let hTemp = hours * 1 + 12;
       hours = hTemp.toString();
     }
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Survived] ArithmeticOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:20:19
   const convert24Hourto12Hour = (time) => {
     let [hours, minutes] = [time.slice(0, 2), time.slice(-2)];
     if (hours * 1 > 12) {
-      let hTemp = hours * 1 - 12;
+      let hTemp = hours / 1 - 12;
       hours = hTemp.toString();
     }

[Killed] ConditionalExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:96:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body style={style.padding5}>
-          {style.height >= 20 && (
+          {true && (
             <Card.Text data-testid={`${testId}-title`} style={style.title}>
               {event.title}
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:10 with font size null
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="card-text" data-testid="PersonalSectionsEvent-title" style="font-size: 10px; overflow: hidden; white-space: nowrap; text-overflow: ellipsis; text-align: left; margin: 0px;">CHEM184</p> instead

[Killed] ConditionalExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:96:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body style={style.padding5}>
-          {style.height >= 20 && (
-            <Card.Text data-testid={`${testId}-title`} style={style.title}>
-              {event.title}
-            </Card.Text>
-          )}
+          {true}
           {style.height >= 40 && (
             <Card.Text
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:97:37
       >
         <Card.Body style={style.padding5}>
           {style.height >= 20 && (
-            <Card.Text data-testid={`${testId}-title`} style={style.title}>
+            <Card.Text data-testid={``} style={style.title}>
               {event.title}
             </Card.Text>
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:20 with font size 10px
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:101:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && (
-            <Card.Text
-              data-testid={`${testId}-time`}
-              style={{ fontSize: "12px", textAlign: "left" }}
-            >
-              {convert24Hourto12Hour(event.startTime)} -{" "}
-              {convert24Hourto12Hour(event.endTime)}
-            </Card.Text>
-          )}
+          {true}
         </Card.Body>
       </Card>
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] ConditionalExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:101:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && (
+          {true && (
             <Card.Text
               data-testid={`${testId}-time`}
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:10 with font size null
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p class="card-text" data-testid="PersonalSectionsEvent-time" style="font-size: 12px; text-align: left;">12:00 - 12:10</p> instead

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:103:28
           )}
           {style.height >= 40 && (
             <Card.Text
-              data-testid={`${testId}-time`}
+              data-testid={``}
               style={{ fontSize: "12px", textAlign: "left" }}
             >
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:40 with font size 14px
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsEvent-time"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Survived] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:106:58
               data-testid={`${testId}-time`}
               style={{ fontSize: "12px", textAlign: "left" }}
             >
-              {convert24Hourto12Hour(event.startTime)} -{" "}
+              {convert24Hourto12Hour(event.startTime)} -{""}
               {convert24Hourto12Hour(event.endTime)}
             </Card.Text>
