[Killed] ArrayDeclaration
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:5:20
 import { Container, Row, Col, Card } from "react-bootstrap";
 import PersonalSectionsEvents from "./PersonalSchedulesWeeklyViewEvent";
 
-const daysOfWeek = [
-  "Monday",
-  "Tuesday",
-  "Wednesday",
-  "Thursday",
-  "Friday",
-  "Saturday",
-  "Sunday",
-];
+const daysOfWeek = [];
 
 const hours = [
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Monday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:7:3
 
 const daysOfWeek = [
   "Monday",
-  "Tuesday",
+  "",
   "Wednesday",
   "Thursday",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Tuesday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:9:3
   "Monday",
   "Tuesday",
   "Wednesday",
-  "Thursday",
+  "",
   "Friday",
   "Saturday",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Thursday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:11:3
   "Wednesday",
   "Thursday",
   "Friday",
-  "Saturday",
+  "",
   "Sunday",
 ];
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Saturday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:12:3
   "Thursday",
   "Friday",
   "Saturday",
-  "Sunday",
+  "",
 ];
 
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Sunday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:17:3
 
 const hours = [
   "",
-  "1 AM",
+  "",
   "2 AM",
   "3 AM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:20:3
   "1 AM",
   "2 AM",
   "3 AM",
-  "4 AM",
+  "",
   "5 AM",
   "6 AM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:23:3
   "4 AM",
   "5 AM",
   "6 AM",
-  "7 AM",
+  "",
   "8 AM",
   "9 AM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:27:3
   "8 AM",
   "9 AM",
   "10 AM",
-  "11 AM",
+  "",
   "12 PM",
   "1 PM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:29:3
   "10 AM",
   "11 AM",
   "12 PM",
-  "1 PM",
+  "",
   "2 PM",
   "3 PM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:30:3
   "11 AM",
   "12 PM",
   "1 PM",
-  "2 PM",
+  "",
   "3 PM",
   "4 PM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:32:3
   "1 PM",
   "2 PM",
   "3 PM",
-  "4 PM",
+  "",
   "5 PM",
   "6 PM",
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:39:3
   "8 PM",
   "9 PM",
   "10 PM",
-  "11 PM",
+  "",
 ];
 
killedBy: PersonalSchedulesWeeklyViewPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="PersonalSchedulesWeeklyView--title"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="PersonalSchedulesWeeklyView--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"

[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:59:26
           <Col
             key={day}
             style={styles.dayColumn}
-            data-testid={`${testId}-${day}-column`}
+            data-testid={``}
           >
             <Card style={styles.dayCard}>
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSchedulesWeeklyView-Monday-column"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:70:16
                   {day}
                 </Card.Title>
               </Card.Body>
-              {Events.filter(
-                (event) => event.day.includes(day) && event.startTime !== "",
-              ).map((event) => (
+              {Events.map((event) => (
                 <PersonalSectionsEvents
                   key={event.id}
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 7

[Killed] ArrowFunction
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:71:17
                 </Card.Title>
               </Card.Body>
               {Events.filter(
-                (event) => event.day.includes(day) && event.startTime !== "",
+                () => undefined,
               ).map((event) => (
                 <PersonalSectionsEvents
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsEvent-12583"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"

[Killed] LogicalOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:71:28
                 </Card.Title>
               </Card.Body>
               {Events.filter(
-                (event) => event.day.includes(day) && event.startTime !== "",
+                (event) => event.day.includes(day) || event.startTime !== "",
               ).map((event) => (
                 <PersonalSectionsEvents
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 7

[Killed] ArrowFunction
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:72:21
               </Card.Body>
               {Events.filter(
                 (event) => event.day.includes(day) && event.startTime !== "",
-              ).map((event) => (
-                <PersonalSectionsEvents
-                  key={event.id}
-                  event={event}
-                  eventColor={eventColor}
-                  borderColor={borderColor}
-                />
-              ))}
+              ).map(() => undefined)}
             </Card>
           </Col>
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsEvent-12583"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
