[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:30:5
 export function isLectureWithNoSections(enrollCode, sections) {
   // Find the section with the given enrollCode
   const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
+    () => undefined,
   );
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:43:9
     const timeLocations = section.section.timeLocations;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
+    if (true) {
       // Filter all sections with the same courseId
       // Stryker disable all
killedBy: isLectureWithNoSections should return false when the section is not a lecture
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:49:16
       // Stryker restore all
       // Check if there is only one section for the course
       return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    } else if (sectionNumber === "00") {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:49:16
       // Stryker restore all
       // Check if there is only one section for the course
       return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    } else if (false) {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:52:9
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
+        true
       );
     }
killedBy: isLectureWithNoSections should return false when the section number ends in 00 and is not 0100 and does not have a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:72:9
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
+    if (true) {
       // Filter all sections with the same courseId
       // Stryker disable all
killedBy: isLectureWithSections should return false when section number does not end with '00'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:80:14
       );
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length > 1;
+      return courseSections.length <= 1;
     }
   }
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:110:21
 export const handleLectureAddToSchedule = (section, schedule, mutation) => {
   // Execute the mutation with the provided data
   console.log(section);
-  const dataFinal = {
-    enrollCd: section,
-    psId: schedule,
-  };
+  const dataFinal = {};
   console.log(dataFinal);
   mutation.mutate(dataFinal);
killedBy: handleLectureAddToSchedule should execute the mutation with the provided data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "enrollCd": 12345,
-   "psId": "FALL2023",

[Killed] OptionalChaining
main/components/Sections/SectionsTable.js:132:5
 
 export const onError = (error) => {
   const message =
-    error.response?.data?.message || "An unexpected error occurred";
+    error.response?.data.message || "An unexpected error occurred";
   toast.error(message);
 };
killedBy: Section tests onError displays default message when error.response.data is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
