[Killed] ArrowFunction
src/main/utils/sectionUtils.js:108:32
   </p>
 );
 
-export const formatTitleLink = (row) => (
-  <a href={`/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`} >
-      {row.courseInfo.title}
-  </a>
-);
+export const formatTitleLink = () => undefined;
 
 export const renderTitleLink = ({ cell: { value } }) => (
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  COMP ENGR SEMINAR
Received:

[Killed] ArrowFunction
src/main/utils/sectionUtils.js:114:32
   </a>
 );
 
-export const renderTitleLink = ({ cell: { value } }) => (
-   <p align="center">
-      {value}
-  </p>
-);
+export const renderTitleLink = () => undefined;
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  COMP ENGR SEMINAR
Received:
