[Survived] ArrayDeclaration
main/pages/GeneralEducation/GeneralEducationSearchPage.js:8:50
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function GeneralEducationSearchPage() {
-  const [sectionJSON, setSectionJSON] = useState([]);
+  const [sectionJSON, setSectionJSON] = useState(["Stryker was here"]);
 
   // Stryker disable all

[Survived] BlockStatement
main/pages/GeneralEducation/GeneralEducationSearchPage.js:22:35
   // Stryker restore all
 
   // Callback function to update state with fetched sections
-  const onSuccess = (sections) => {
-    setSectionJSON(sections);
-  };
+  const onSuccess = (sections) => {};
 
   // Hook to handle the backend API mutation (search)

[Survived] BlockStatement
main/pages/GeneralEducation/GeneralEducationSearchPage.js:35:67
   );
 
   // Function to trigger the API call, passed to the search form
-  async function fetchGeneralEducationSectionsJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchGeneralEducationSectionsJSON(_event, query) {}
 
   return (
